{"modelTopology": {"keras_version": "2.1.6", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": [{"class_name": "TimeDistributed", "config": {"name": "time_distributed_1", "trainable": true, "batch_input_shape": [null, 22, 25], "dtype": "float32", "layer": {"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 25], "dtype": "float32", "input_dim": 750, "output_dim": 300, "embeddings_initializer": {"class_name": "PreSavedEmbeddingsInitializer", "config": [["__", [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]], [",", [-0.023167, -0.0042483, -0.10572, 0.042783, -0.14316, -0.078954, 0.078187, -0.19454, 0.022303, 0.31207, 0.057462, -0.11589, 0.096633, -0.093229, -0.034229, -0.14652, -0.11094, -0.11102, 0.067728, 0.10023, -0.067413, 0.23761, -0.13105, -0.0083979, -0.10593, 0.24526, 0.065903, -0.2374, -0.10758, 0.0057082, -0.081413, 0.26264, -0.052461, 0.20306, 0.05062, -0.18866, -0.11494, -0.25752, 0.046799, -0.050525, 0.06265, 0.15433, -0.056289, -0.048437, -0.099688, -0.035332, -0.091647, -0.081151, -0.0010844, -0.08414, -0.13026, 0.01498, -0.086276, -0.053041, -0.10644, -0.042314, 0.086469, 0.22614, -0.16078, 0.18845, 0.053098, -0.21475, 0.16699, -0.14442, -0.1593, 0.0062456, -0.07663, -0.091568, -0.28984, 0.027078, 0.021275, 0.023939, 0.14903, -0.33062, -0.097811, -0.033814, 0.070587, 0.023294, 0.065382, 0.18716, -0.13444, 0.14431, -0.0268, -0.022903, 0.097554, -0.032909, -0.027827, -0.068771, 0.17053, -0.05946, 0.020424, -0.077589, 0.1216, -0.077437, 0.10665, 0.051087, 0.0076379, -0.064936, 0.09031, 0.059447, 0.0048881, 0.078309, -0.012163, 0.062155, -0.072664, 0.17857, -0.22874, 0.066397, -0.039295, -0.027717, 0.061571, 0.072824, -0.092512, -0.087984, -0.12753, -0.0018705, 0.18689, 0.0051173, -0.0013532, 0.043246, 0.10867, -0.12209, -0.0091676, 0.23938, -0.059501, -0.0010456, 0.086584, 0.020238, 0.21686, 0.16495, 0.037256, 0.12343, 0.17706, 0.075777, 0.031022, -0.12948, 0.030936, 0.096897, -0.10793, 0.12644, -0.056489, 0.082232, 0.20679, 0.11679, 0.13965, 0.26362, 0.037603, -0.003105, -0.089501, -0.0076969, -0.11654, -0.28567, 0.046616, -0.0082062, 0.15621, -0.14641, 0.064561, -0.1133, 0.27129, 0.14532, -0.021773, 0.23305, -0.1617, 0.15705, 0.13845, 0.022417, -0.10982, -0.049431, 0.076855, -0.0453, -0.19029, 0.011183, -0.010393, 0.0016916, 0.089407, -0.051022, -0.086066, 0.083933, -0.0081962, -0.0077321, 0.033991, -0.20092, 0.03328, 0.062224, 0.016121, 0.27143, -0.19754, -0.15222, -0.015345, -0.063907, -0.098597, -0.20162, 0.14004, -1.1533e-05, -0.18928, 0.12253, -0.0070378, 0.0864, -0.30255, -0.03908, 0.045517, -0.16449, -0.23548, 0.052781, 0.13847, -0.20022, -0.015974, 0.027137, 0.18287, -0.02389, 0.22072, -0.04271, -0.075939, -0.087386, -0.049337, 0.047824, -0.059078, -0.15181, -0.21229, -0.054944, -0.011453, -0.11996, -0.15307, -0.054828, -0.053217, -0.048546, 0.028856, -0.094537, 0.27144, 0.054638, 0.059727, 0.061772, 0.009259, -0.12032, -0.16646, -0.029087, 0.0028752, -0.16076, -0.1371, -0.18988, 0.022857, 0.18455, -0.018236, -0.0060562, 0.14302, 0.032535, 0.14333, -0.030871, -0.15218, 0.092813, 0.066358, 0.018316, -0.24143, 0.0054391, -0.064479, -0.08596, 0.030446, 0.082157, 0.026093, 0.058985, 0.0051085, 0.089127, -0.018164, -0.077821, 0.0034232, 0.13892, 0.046106, -0.05417, 0.0084399, -0.15362, -0.14735, 0.065191, -0.022883, -0.14498, -0.16917, -0.19215, 0.10611, 0.001678, -0.16331, -0.07307, 0.11576, 0.083567, -0.060317, -0.064714, 0.15305, -0.11949, 0.16684, 0.14109, 0.046036, -0.060393, 0.046595, -0.11558, 0.044184, -0.023124, 0.02586, -0.11653, 0.010936, 0.089398, -0.0159, 0.14866]], [".", [-0.11112, -0.0013859, -0.1778, 0.064508, -0.24037, 0.031087, -0.030144, -0.36883, -0.043855, 0.24831, 0.078633, -0.16072, 0.10528, -0.09622, -0.077742, -0.28262, -0.13013, 0.0056083, 0.19406, 0.19287, -0.10955, 0.23008, -0.19911, 0.18836, -0.21861, 0.0017505, -0.093017, -0.25064, 0.034323, 0.17047, -0.094408, 0.1442, -0.18533, 0.1685, -0.16582, -0.061712, -0.010346, -0.078817, 0.20596, -0.12286, -0.064035, -0.040983, -0.21272, 0.097636, -0.058569, -0.044869, 0.028206, -0.12619, 0.012063, -0.19177, -0.044824, -0.081765, -0.073723, 0.037251, -0.075625, 0.0085609, 0.062612, 0.22144, -0.10765, 0.1617, 0.065163, -0.38164, 0.40246, -0.40637, -0.15695, -0.026063, 0.08266, -0.21487, -0.19077, 0.015702, 0.0019313, 0.028565, -0.11221, -0.32311, -0.11034, -0.0036508, 0.098677, 0.044877, -0.037888, 0.055357, -0.083052, 0.1388, -0.014431, 0.03675, 0.024439, -0.23493, -0.027343, 0.079749, 0.033782, -0.14431, -0.12995, 0.0013884, 0.12936, -0.025757, 0.14235, -0.039069, 0.04441, -0.10727, 0.010207, -0.25722, 0.0108, 0.13833, -0.12007, 0.1007, -0.032493, 0.039002, -0.22527, -0.0082154, 0.089996, 0.12834, -0.042059, 0.034393, -0.062866, -0.17397, -0.12022, 0.10377, 0.23975, 0.0168, 0.013164, 0.1788, 0.15969, -0.09956, -0.00033453, 0.14833, 0.0023907, 0.012985, 0.018713, -0.013954, 0.017909, 0.18023, -0.061768, 0.13785, 0.11028, 0.06795, -0.093466, 0.065266, 0.081291, 0.074469, -0.14988, 0.27212, -0.24042, 0.10926, 0.18611, 0.25639, 0.26599, -0.033769, 0.035854, 0.046225, -0.096937, -0.022181, -0.0093109, -0.17216, -0.0052176, -0.087209, 0.16378, -0.1748, 0.10675, -0.11914, 0.11579, 0.28104, 0.031467, 0.089572, -0.076408, 0.091939, 0.10972, 0.10825, 0.044846, -0.10262, 0.011195, 0.12233, -0.21444, -0.0085801, -0.20019, 0.076398, 0.069234, -0.00027189, -0.14671, 0.0020823, 0.10946, -0.026161, -0.03566, -0.20662, -0.017169, 0.14491, -0.018133, 0.26558, -0.071692, -0.32038, 0.090198, 0.038957, -0.13264, -0.082944, 0.28167, 0.095751, -0.21677, 0.036769, 0.002427, 0.073605, -0.34857, -0.023093, -0.082191, -0.10558, 0.029198, 0.092549, 0.26644, -0.1304, -0.14764, 0.2099, 0.17682, -0.078109, 0.15883, -0.12386, -0.036651, -0.035916, -0.080906, -0.052342, -0.043183, -0.15264, -0.12676, 0.13355, 0.04599, -0.063914, 0.12744, -0.1052, -0.12274, 0.08151, 0.055437, -0.1856, 0.10727, 0.098527, 0.06622, 0.22512, -0.19452, -0.058842, 0.060798, 0.08935, -0.050251, -0.075885, -0.13478, -0.19397, 0.00089476, 0.24309, -0.042496, 0.016901, 0.15118, 0.037475, 0.13201, 0.052854, -0.15011, 0.025235, 0.02491, 0.04034, -0.40257, 0.03001, 0.014418, -0.0089364, 0.036583, 0.022269, -0.074602, 0.10987, 0.018079, 0.19326, 0.038292, 0.080146, 0.053901, 0.13042, 0.004338, -0.15412, 0.092865, -0.059374, -0.033619, 0.044073, 0.066178, -0.16668, -0.062453, -0.2339, -0.026025, -0.028359, -0.25575, -0.10586, 0.099423, 0.15685, -0.12659, -0.22975, 0.15002, -0.16253, 0.095208, 0.30722, 0.052365, -0.10963, 0.095332, -0.21914, -0.04276, -0.13685, 0.09747, -0.21818, -0.058233, 0.063374, -0.12161, 0.039339]], ["of", [0.048804, -0.28528, 0.018557, 0.20577, 0.060704, 0.085446, -0.036267, -0.068373, 0.14507, 0.17852, 0.14579, -0.1363, 0.23348, 0.029758, -0.22001, -0.0045515, -0.11197, -0.041367, 0.084231, 0.076673, -0.24461, 0.053593, -0.10939, -0.12468, -0.2029, 0.074565, 0.1066, 0.054339, 0.088268, 0.22557, -0.029081, 0.298, -0.16129, 0.36419, 0.073978, -0.089561, -0.041104, -0.24277, -0.005801, -0.062838, 0.061766, -0.06338, 0.064886, 0.076681, 0.054731, -0.12146, -0.10907, -0.092789, 0.033569, -0.18984, 0.0891, 0.013016, -0.051571, 0.02804, 0.12697, -0.077554, 0.15722, 0.077476, -0.16343, 0.16547, -0.26099, -0.29122, 0.30182, -0.16759, -0.056519, -0.12898, -0.19702, -0.15118, -0.13374, -0.15003, -0.23525, -0.15915, 0.13042, -0.027344, -0.12427, -0.043631, 0.12414, 0.34889, 0.049437, -0.010112, 0.20247, 0.082294, -0.15157, -0.22737, 0.12064, -0.061304, -0.077713, 0.1096, -0.096096, -0.20338, -0.02294, 0.15945, 0.23325, -0.23107, 0.052684, -0.096946, 0.057373, 0.14143, 0.076547, 0.018265, 0.064091, 0.044858, 0.088128, -0.11694, -0.2496, -0.13049, -0.083017, -0.060082, 0.024055, -0.020748, 0.039135, 0.043567, -0.10208, -0.15464, 0.12892, -0.02419, 0.04537, 0.12778, 0.13212, 0.19208, 0.24737, 0.12406, -0.20246, 0.13762, -0.023151, 0.041736, -0.013967, 0.18194, 0.1621, 0.062586, -0.079981, 0.13184, -0.077388, 0.020313, -0.041488, 0.020524, -0.1131, 0.14639, 0.080113, 0.03685, 0.1364, -0.0097955, 0.11779, 0.13547, 0.2289, 0.21231, -0.079779, 0.13831, -0.076114, 0.028563, 0.11441, -0.15455, -0.083267, -0.057167, -0.099352, -0.17063, -0.071757, -0.051497, 0.26568, 0.018799, -0.2722, 0.1268, -0.021045, 0.058831, 0.30213, -0.035255, -0.095952, -0.039082, 0.20369, -0.17869, -0.26188, -0.11006, -0.15694, -0.028803, -0.23872, 0.15594, 0.0087185, 0.24053, 0.12139, 0.13728, 0.015927, -0.013386, -0.069045, 0.10303, -0.072071, 0.27962, 0.19157, -0.1381, 0.071393, -0.031548, -0.035299, -0.074609, 0.20415, 0.07185, -0.068672, -0.041217, -0.087057, -0.11665, -0.20257, 0.073188, -0.073497, -0.27951, -0.17393, 0.064005, -0.050394, -0.044426, 0.0084868, 0.065147, 0.075381, 0.11124, 0.24971, 0.16696, 0.040472, -0.14533, 0.016763, -0.11273, 0.017435, -0.19177, -0.044961, 0.085638, 0.079341, -0.046213, -0.20255, 0.26274, -0.091053, 0.077721, -0.15454, 0.042321, 0.11742, -0.086041, 0.087611, 0.21365, -0.13597, -0.029987, -0.021053, 0.026222, -0.063741, -0.083649, 0.016566, 0.043541, -0.039012, -0.0099747, 0.13427, 0.063209, 0.22825, 0.14844, 0.032926, -0.19012, 0.19838, -0.22369, 0.00018847, 0.17405, -0.037903, 0.020661, -0.084053, 0.18419, 0.028517, -0.098006, 0.19939, 0.07981, 0.1241, 0.09525, -0.035341, 0.08413, -0.082303, -0.075792, 0.16535, 0.11581, 0.013019, -0.080894, -0.0104, -0.078736, -0.11122, 0.028996, -0.06331, -0.03393, 0.020572, 0.26452, 0.0017304, 0.019002, 0.14132, -0.07911, 0.15356, 0.072873, 0.087168, -0.005553, -0.020073, 0.15022, -0.015351, 0.16743, 0.16956, -0.33677, -0.060286, 0.086097, -0.065001, 0.0048331, -0.10096, 0.1391, -0.13714, -0.039705]], ["-", [-0.12278, -0.036748, 0.20728, -0.018277, -0.0016348, 0.023735, -0.03712, -0.28608, -0.19088, -0.068688, 0.061755, -0.052416, 0.16867, -0.1108, -0.11308, -0.27392, -0.30827, 0.18204, 0.096594, 0.29725, -0.050727, 0.023406, -0.33813, -0.10599, -0.11249, 0.066722, 0.14842, -0.31099, -0.09372, 0.0027705, -0.16806, 0.20955, -0.23591, 0.070785, -0.25399, -0.1121, -0.12584, -0.11348, -0.13821, -0.37261, 0.1712, 0.091039, 0.12721, 0.033067, -0.033074, 0.03804, -0.18015, 0.043457, 0.099211, 0.037043, -0.0035936, -0.35885, -0.1046, -0.24532, 0.12304, 0.11229, 0.0019709, 0.16426, 0.051579, 0.081311, -0.0034787, -0.17466, 0.30059, -0.23183, -0.017487, 0.28647, 0.39977, 0.10196, -0.31603, -0.080053, 0.1363, -0.27921, -0.070414, -0.42057, 0.22811, -0.0048721, 0.28294, 0.13337, -0.13565, 0.36156, -0.21077, 0.0951, -0.078161, -0.19526, 0.12015, -0.34326, 0.091878, -0.1481, 0.15075, -0.032191, -0.084192, 0.012534, -0.27388, -0.03702, 0.057868, -0.077148, 0.089935, -0.0085872, -0.17457, -0.019762, 0.053098, 0.17929, 0.095319, 0.01531, 0.30705, -0.10108, -0.32163, -0.030811, -0.12402, 0.097465, 0.17987, 0.14868, -0.15284, -0.09303, 0.0088417, -0.19254, -0.01618, -0.23722, -0.012689, 0.080786, 0.1699, -0.32962, 0.21784, 0.22417, -0.11523, -0.1468, 0.16493, -0.013706, 0.061769, 0.24206, -0.0030724, 0.13193, 0.33641, 0.082406, -0.090267, -0.062518, 0.20536, -0.0067834, 0.23309, 0.42543, 0.12784, 0.043186, 0.31441, 0.29966, 0.3764, 0.11003, 0.078855, 0.070249, -0.1237, -0.16134, 0.096781, -0.26828, -0.34072, -0.2443, 0.23486, 0.0035705, 0.022555, -0.11751, 0.21934, 0.1186, -0.19583, -0.013163, -0.1533, 0.059138, 0.36918, -0.066211, -0.12353, -0.18454, 0.075356, 0.054704, -0.21953, 0.053431, -0.024889, 0.26166, 0.23565, -0.041392, 0.067851, -0.096325, 0.37606, -0.057649, 0.02432, 0.056076, -0.23126, 0.23585, 0.16382, 0.53816, -0.13254, -0.59859, 0.045303, 0.18787, -0.055629, -0.263, 0.21436, -0.16295, -0.10764, -0.059118, 0.016773, 0.014789, -0.13096, -0.10807, -0.096707, 0.13387, -0.18756, -0.014248, 0.095107, -0.10209, -0.16448, -0.094758, 0.14591, 0.16369, 0.20648, -0.073274, -0.056667, -0.053844, -0.16913, 0.015068, 0.19947, -0.17929, -0.52126, 0.2772, -0.23779, 0.19949, -0.20515, -0.19561, -0.30977, -0.066952, 0.067665, 0.11951, 0.15856, 0.18632, 0.1467, 0.1089, -0.086139, -0.036918, 0.034145, 0.11727, -0.0038274, -0.019283, -0.13522, -0.17907, 0.12257, 0.010163, -0.070272, -0.019652, 0.35313, -0.028667, 0.25019, 0.24459, -0.24002, 0.15758, -0.0019125, 0.005391, -0.21876, 0.17596, -0.079358, -0.081188, 0.020766, 0.08006, -0.020661, 0.092431, -0.033553, 0.23134, 0.0011203, 0.17548, -0.3203, 0.14953, -0.082272, -0.16887, 0.2853, -0.27014, -0.34351, 0.14424, 0.16748, -0.31432, -0.31462, -0.05592, 0.053108, -0.0015233, -0.067186, -0.088541, 0.021988, 0.29623, -0.17202, -0.13207, 0.10663, 0.13491, 0.29138, 0.15629, -0.08598, 0.090109, 0.14234, -0.16496, 0.35746, 0.10796, 0.03212, 0.012067, 0.018267, -0.06944, 0.28509, 0.06188]], ["in", [0.12367, -0.13965, 0.044877, 0.18919, -0.10997, -0.0064458, 0.050499, -0.20439, -0.015761, 0.15049, 0.13774, -0.068241, 0.17078, -0.13529, -0.18324, -0.00035567, -0.099566, -0.14549, 0.067183, 0.028273, -0.10084, 0.10498, -0.24613, 0.008831, -0.18437, 0.050011, -0.032839, -0.069129, 0.0043659, 0.11011, -0.32272, 0.26625, -0.12465, 0.32157, 0.067982, -0.22671, 0.081843, 0.11435, 0.062067, -0.072973, -0.013415, -0.048493, -0.11426, 0.069743, -0.070937, -0.062886, -0.015692, -0.033663, 0.10441, 0.0050113, -0.0017716, 0.01172, -0.086168, 0.012221, -0.14817, 0.035373, 0.039869, 0.29904, 0.02467, 0.18096, 0.070858, -0.3536, 0.090518, -0.12905, -0.010443, -0.18697, -0.21258, -0.044644, -0.25333, 0.10031, -0.17369, -0.037354, -0.030931, -0.091972, -0.068233, 0.022366, 0.12569, 0.13749, -0.079547, 0.0071489, -0.15117, 0.27538, 0.13964, 0.0088001, -0.0032892, -0.21313, -0.060543, -0.12321, -0.14875, -0.22362, -0.21024, -0.088803, 0.29222, -0.25967, 0.22331, -0.045337, -0.03181, 0.20282, -0.072763, 0.08423, -0.13619, -0.065391, 0.045686, 0.13292, -0.16045, 0.068327, -0.085854, 0.1138, -0.037301, 0.1485, 0.11429, 0.075152, -0.082689, -0.1272, -0.025567, 0.0070075, 0.26045, -0.065811, 0.032715, 0.19796, 0.16154, 0.04616, -0.1811, 0.2221, -0.097602, -0.16946, 0.14142, 0.099035, 0.15536, 0.19277, -0.077073, 0.1304, 0.078304, 0.073262, -0.14858, 0.154, -0.10688, 0.055093, 0.0086387, 0.19326, -0.026862, 0.26057, 0.052728, -0.11463, 0.17869, 0.39083, 0.25172, 0.1414, -0.066381, 0.09811, -0.12604, -0.053404, -0.12783, 0.015113, -0.15912, -0.19647, 0.17831, 0.01199, 0.079011, 0.038148, -0.1492, 0.37324, -0.26121, 0.12813, 0.12836, 0.053578, -0.076507, 0.076671, 0.13526, -0.0133, -0.16123, -0.10848, -0.025315, -0.17731, 0.076161, -0.060174, 0.14036, 0.23606, 0.013044, -0.0038421, 0.18789, -0.088722, 0.032518, 0.22781, -0.023559, 0.084643, 0.12242, 0.0088557, 0.076508, -0.0050585, -0.099194, -0.067806, 0.059907, 0.035404, 0.018719, -0.026816, -0.0043838, 0.082026, -0.11986, -0.20797, 0.1857, -0.093772, -0.016299, 0.16044, 0.033307, -0.15447, -0.1299, 0.12446, 0.10375, 0.15186, 0.17916, -0.0392, -0.17544, 0.011754, -0.083566, -0.0018136, 0.12672, -0.20117, -0.16977, -0.14783, 0.044156, -0.17907, -0.046772, -0.0019811, -0.037412, 0.001387, -0.10561, -0.15427, 0.14016, 0.041157, 0.19222, 0.012073, -0.066753, -0.025257, -0.15648, 0.024427, -0.018674, -0.16705, -0.05062, -0.075287, 0.043062, 0.0061818, 0.10573, -0.0029119, 0.071643, 0.13324, 0.24889, -0.012998, -0.077142, 0.1755, 0.16971, -0.034875, 0.084939, -0.19587, -0.26115, -0.052924, -0.23034, -0.13479, 0.13933, 0.041106, 0.045816, 0.11113, -0.0703, 0.012925, 0.13977, -0.063616, 0.043891, 0.027855, -0.03961, -0.095799, -0.12588, -0.084711, -0.0042531, -0.059085, -0.093324, -0.33958, 0.063525, 0.082276, 0.062395, -0.099955, 0.014326, 0.042645, 0.080227, 0.089646, 0.1758, 0.034153, 0.00055167, 0.11687, -0.089006, -0.0084893, 0.025115, -0.31804, 0.12533, -0.081507, -0.1114, 0.017582, -0.037359, 0.06474, -0.14581, 0.16175]], ["'", [-0.17489, -0.13695, 0.13345, -0.07282, 0.038794, 0.13294, 0.0015304, -0.071056, -0.20026, -0.045437, -0.0019054, -0.17913, 0.18241, -0.058909, -0.0088248, 0.060522, 0.1872, 0.2255, -0.11638, 0.080349, -0.33614, -0.035788, -0.21518, -0.062891, -0.1322, -0.09628, 0.065516, 0.16418, -0.014492, 0.11139, -0.25025, 0.25303, -0.20538, -0.027447, -0.18057, -0.13118, -0.36836, 0.055097, 0.23968, -0.17034, 0.26393, 0.30392, -0.18615, 0.13712, -0.012511, 0.11977, 0.00017869, 0.059385, -0.05704, -0.046391, 0.012484, -0.067036, 0.20004, -0.34513, -0.16117, -0.082885, -0.043013, 0.031685, -0.01498, 0.11803, 0.068215, -0.18596, 0.11503, -0.020593, -0.15533, 0.031101, 0.1294, 0.038285, -0.075081, -0.095411, 0.13559, -0.13448, -0.092657, -0.39257, -0.1617, -0.06562, 0.069601, 0.26207, -0.039711, 0.39187, 0.16218, 0.053275, -0.066056, 0.10139, -0.076679, -0.059841, -0.069376, 0.21551, -0.029553, -0.123, 0.011586, 0.16999, 0.17508, 0.090918, 0.10799, 0.085566, -0.0042548, 0.097031, 0.18012, -0.24137, -0.1599, 0.018539, -0.1056, -0.052341, -0.034019, -0.13327, -0.15889, 0.033714, 0.079085, -0.01673, 0.062222, 0.16459, -0.021192, 0.014571, -0.017858, 0.17836, 0.13005, 0.27747, 0.056348, 0.13513, 0.4205, 0.024011, 0.18547, 0.030009, 0.119, -0.058, -0.092228, 0.025134, 0.003047, -0.024764, 0.11025, 0.21792, 0.12071, 0.26308, 0.13265, 0.058854, -0.36855, -0.04149, 0.10599, 0.25175, -0.028787, -0.043812, -0.036435, 0.0089733, 0.066932, 0.1702, 0.1665, 0.094226, -0.14053, -0.18362, -0.035076, 0.11685, -0.08793, -0.17653, -0.24763, 0.12285, 0.0053936, -0.048667, 0.23958, 0.17958, -0.21611, 0.08723, -0.17605, 0.17473, 0.14182, 0.081131, -0.087419, 0.071543, 0.21449, -0.061005, -0.07196, -0.23685, -0.11879, -0.0071595, -0.071583, 0.049396, -0.02676, 0.068993, 0.0073673, -0.038216, 0.16864, 0.16553, 0.01517, 0.15875, -0.1054, 0.05747, 0.13809, -0.019921, 0.36033, 0.21684, 0.063086, -0.11092, 0.35303, 0.30894, 0.12569, -0.008461, 0.25211, -0.073476, -0.442, 0.022188, -0.0423, -0.018912, -0.15181, 0.19475, 0.043222, -0.23028, -0.25009, 0.011266, 0.14797, 0.22005, 0.40872, -0.13427, -0.18417, 0.011872, -0.1966, -0.18597, 0.13815, -0.22767, -0.17908, 0.10512, -0.057826, 0.071071, -0.23812, -0.0067891, 0.036996, -0.029889, -0.17022, 0.14456, 0.040532, -0.029142, -0.012301, 0.2311, -0.14316, -0.22666, -0.19614, 0.15429, -0.023078, 0.015926, -0.077029, 0.065054, -0.30557, 0.13245, 0.068753, 0.11286, 0.14658, 0.2298, 0.18136, 0.22165, 0.1076, 0.0045102, 0.1825, 0.10714, 0.027691, 0.13585, 0.07148, 0.033098, 0.030476, -0.13848, 0.23759, -0.26323, 0.095756, 0.15745, 0.099187, 0.013283, -0.030978, 0.10267, 0.030753, 0.22487, -0.014633, -0.16486, -0.30891, 0.0551, -0.15767, -0.11141, 0.034447, -0.054475, 0.33544, -0.0042994, 0.27241, -0.15068, 0.096341, 0.14226, 0.097858, 0.00082821, -0.0092396, 0.10388, 0.18306, 0.39652, 0.21525, -0.01238, -0.040262, -0.1476, -0.0018151, -0.040134, -0.17208, -0.225, -0.18652, 0.13567, 0.20318, 0.10497]], [")", [-0.2126, -0.1625, 0.19291, -0.025168, -0.053647, -0.060966, 0.045574, -0.21204, -0.12945, 0.16739, -0.091312, -0.18321, 0.24384, -0.18695, 0.1443, 0.059095, -0.14303, -0.037694, -0.035785, 0.11922, -0.011128, 0.21314, -0.27044, 0.077567, -0.018137, 0.1594, -0.043637, -0.25154, 0.069122, 0.023117, -0.30039, 0.28047, -0.20755, 0.1845, 0.02708, -0.011796, -0.19094, -0.22944, 0.15557, -0.28047, 0.033552, 0.13621, -0.16158, 0.020503, -0.10356, -0.21584, -0.1115, -0.056023, 0.10392, -0.023046, 0.033985, -0.26918, -0.03143, -0.26883, -0.098116, -0.17722, 0.080194, -0.044145, -0.064201, 0.21535, 0.16698, -0.25132, 0.21311, -0.16862, 0.084063, -0.066586, 0.16939, -0.27313, -0.2829, 0.027755, 0.051774, 0.056767, 0.023735, -0.19652, 0.12754, -0.015561, 0.26425, 0.27562, 0.086458, 0.38182, -0.14553, 0.20525, -0.024237, 0.054286, 0.25675, -0.17819, 0.074283, 0.044713, 0.088217, -0.033261, 0.19087, -0.19817, 0.034355, -0.085662, -0.0048418, -0.056916, -0.1033, 0.006265, 0.17492, 0.027866, 0.084206, 0.0674, -0.21523, 0.041361, 0.17755, -0.022406, -0.1821, -0.011688, 0.15014, -0.16614, 0.077185, -0.016522, -0.19297, -0.13536, -0.062133, 0.07223, 0.059149, 0.0010406, -0.16859, 0.078426, 0.34513, -0.12174, -0.1464, 0.28904, 0.010986, 0.096763, -0.048568, 0.2518, 0.12331, 0.06257, 0.15267, 0.17711, 0.25384, 0.3384, 0.092287, 0.00019422, 0.093004, -0.1721, 0.10527, 0.19721, 0.070042, 0.10979, 0.14692, 0.093588, 0.13641, 0.22856, 0.22282, 0.089212, -0.069749, 0.080828, -0.1607, 0.063175, -0.1026, -0.14976, 0.064174, -0.0093489, 0.22512, 0.17281, 0.19723, 0.19006, 0.058608, 0.13837, -0.27155, 0.12318, 0.014049, -0.10999, 0.08605, 0.063453, -0.014096, 0.073693, -0.19318, 0.073913, -0.14857, 0.075652, -0.034264, 0.063866, 0.029645, -0.1415, -0.064215, -0.064351, 0.082878, -0.21816, 0.15486, 0.22435, -0.10632, 0.35149, 0.020847, -0.11029, 0.085623, 0.013362, -0.013515, -0.25033, 0.30575, 0.12325, -0.24006, -0.22024, 0.1085, 0.15251, -0.46239, -0.023871, -0.0187, -0.27595, -0.22326, 0.063294, 0.066861, 0.0054138, -0.21897, 0.12192, 0.25844, -0.11957, 0.30079, -0.086595, 0.07059, -0.02802, -0.2091, -0.11872, 0.13817, -0.10185, -0.35833, -0.22782, 0.0063531, -0.039577, -0.051306, 0.015049, -0.0093668, -0.045136, 0.0060684, 0.076519, 0.24035, 0.070766, -0.026567, 0.16117, -0.010365, -0.21722, -0.15059, 0.030043, -0.061588, -0.18267, -0.054825, -0.12734, -0.070047, 0.36237, 0.054465, 0.041087, 0.092893, 0.015996, 0.16168, 0.16533, 0.03856, 0.14239, 0.13336, -0.18878, -0.12308, 0.1819, -0.050355, -0.13599, 0.01481, 0.10454, -0.10483, -0.16066, 0.16406, 0.0059985, -0.045827, 0.097182, -0.012632, 0.26425, -0.01622, -0.11908, -0.085307, 0.037455, -0.1698, 0.0064602, 0.064675, -0.069502, -0.13218, -0.047747, 0.14874, -0.040672, -0.016932, -0.15343, 0.058897, 0.17917, -0.098042, -0.022264, 0.133, 0.034409, 0.39194, 0.078925, 0.33269, 0.18809, -0.19698, -0.15207, 0.11303, 0.095242, -0.012663, -0.16269, -0.007411, 0.13281, 0.13515, 0.27486]], ["(", [-0.23309, -0.15296, 0.18574, -0.052825, -0.024827, -0.05597, 0.051828, -0.21042, -0.10736, 0.1481, -0.073067, -0.18498, 0.24592, -0.16441, 0.12237, 0.046963, -0.10949, -0.022478, -0.0447, 0.13849, -0.053463, 0.20186, -0.2108, 0.10247, 0.017499, 0.17167, -0.002015, -0.26022, 0.038803, 0.014472, -0.27706, 0.31515, -0.21957, 0.20444, 0.030268, -0.045881, -0.2279, -0.21473, 0.23163, -0.2868, 0.030923, 0.14941, -0.14564, 0.022334, -0.12018, -0.22059, -0.10883, -0.062123, 0.11207, -0.035432, 0.03905, -0.30039, -0.024871, -0.29661, -0.071842, -0.17986, 0.083709, -0.047429, -0.10833, 0.21972, 0.15335, -0.29379, 0.16957, -0.16255, 0.045921, -0.07833, 0.18348, -0.24966, -0.29057, 0.011203, 0.010288, 0.052393, 0.0096249, -0.18478, 0.13012, -0.011579, 0.25199, 0.2378, 0.09148, 0.40134, -0.14071, 0.20658, -0.061358, 0.069975, 0.2856, -0.19824, 0.0567, 0.021811, 0.058719, -0.022546, 0.14477, -0.15554, 0.053924, -0.072887, 0.016839, -0.074752, -0.11665, -0.037688, 0.19177, -0.020931, 0.071214, 0.060542, -0.23209, 0.0155, 0.18033, -0.044522, -0.17467, -0.0012956, 0.17471, -0.16881, 0.062072, -0.036062, -0.18079, -0.14591, -0.011288, 0.13394, 0.021847, -0.0023774, -0.17014, 0.065934, 0.35347, -0.10659, -0.13757, 0.2813, 0.017342, 0.14848, -0.070759, 0.28449, 0.1472, 0.035648, 0.14415, 0.14304, 0.23559, 0.32984, 0.1171, -0.044802, 0.045307, -0.11628, 0.088198, 0.18592, 0.024245, 0.13704, 0.11964, 0.13648, 0.13993, 0.22819, 0.20639, 0.12183, -0.10479, 0.040495, -0.20939, 0.062136, -0.075468, -0.14227, 0.069215, 0.0011967, 0.18513, 0.13571, 0.18718, 0.17761, 0.045758, 0.095972, -0.27707, 0.068867, -0.020278, -0.094161, 0.062102, 0.069499, -0.072098, 0.063163, -0.21225, 0.085972, -0.15251, 0.05548, -0.027419, 0.10628, 0.01283, -0.14169, -0.057287, -0.073863, 0.056337, -0.21388, 0.17499, 0.17013, -0.093788, 0.32699, 0.046617, -0.11163, 0.13034, 0.043024, -0.0059465, -0.2548, 0.28502, 0.12449, -0.21813, -0.20569, 0.10454, 0.1004, -0.42906, -0.007037, -0.018476, -0.31813, -0.21764, 0.047122, 0.027254, 0.0017014, -0.23509, 0.14708, 0.29648, -0.10767, 0.33138, -0.078287, 0.089908, -0.088922, -0.21133, -0.094596, 0.13933, -0.089867, -0.34324, -0.19651, 0.0059196, -0.025083, -0.090159, 0.023366, -0.018513, -0.071158, -0.0064573, 0.083286, 0.21143, 0.035236, -0.037667, 0.17583, 0.010726, -0.25549, -0.14307, 0.013955, -0.071004, -0.15664, -0.098823, -0.11756, -0.046788, 0.3264, 0.050847, 0.041035, 0.098737, 0.049633, 0.17132, 0.13964, 0.067877, 0.14413, 0.16669, -0.14594, -0.1377, 0.1902, -0.050886, -0.14369, 0.0096079, 0.098092, -0.098844, -0.1428, 0.1805, 0.026372, -0.029204, 0.085949, -0.036377, 0.26778, -0.025757, -0.10396, -0.047153, 0.020454, -0.19168, -0.014001, 0.062676, -0.091414, -0.095178, -0.06614, 0.13276, -0.014844, -0.0089356, -0.1552, 0.063869, 0.1804, -0.099814, 0.033382, 0.18021, 0.072454, 0.37026, 0.056646, 0.33106, 0.19567, -0.19433, -0.16877, 0.11429, 0.10103, -0.0087225, -0.16495, 0.016876, 0.099402, 0.18834, 0.26413]], ["to", [-0.21341, 0.15353, 0.05288, -0.10995, -0.075249, -0.0040931, 0.037307, -0.12307, -0.16539, 0.18948, 0.018882, -0.037826, -0.032465, -0.00097399, 0.10223, -0.090187, -0.15477, 0.092984, -0.034548, 0.11354, 0.10526, 0.23558, -0.18151, -0.057149, -0.33498, -0.09525, -0.043807, -0.11598, 0.093461, 0.14055, -0.23846, 0.22991, -0.43074, 0.17527, -0.095848, -0.16689, -0.12666, -0.33239, -0.029917, -0.044658, 0.068506, -0.14732, -0.19448, 0.081522, 0.095537, 0.13374, 0.22849, 0.071417, 0.075921, -0.012085, 0.11477, -0.24506, 0.088227, -0.12577, -0.28356, 0.23966, 0.1349, -0.043612, -0.058942, -0.14964, 0.048619, -0.25521, 0.35135, -0.010485, -0.012291, -0.228, -0.24907, 0.17066, -0.22779, 0.12321, -0.23268, 0.068668, 0.062476, -0.28448, -0.058069, -0.02294, 0.32555, 0.14967, 0.039717, 0.12684, 0.062978, -0.01068, -0.11597, -0.16, 0.075278, 0.0643, -0.019621, 0.1161, -0.045974, -0.13481, -0.040836, -0.052048, 0.26106, -0.41484, -0.011617, 0.079744, 0.026266, 0.00090593, -0.017469, -0.14069, 0.18253, -0.085152, 0.082151, -0.14794, 0.031756, -0.043832, -0.089463, -0.025928, 0.064068, 0.1158, 0.063466, -0.10519, 0.030217, -0.12547, -0.18348, -0.18148, 0.16018, -0.066333, -0.056771, 0.068108, -0.045265, 0.021353, -0.082332, 0.29351, 0.22133, -0.14231, 0.068658, 0.060024, -0.079182, 0.27073, -0.036687, -0.0074472, 0.028575, -0.002216, 0.012085, 0.26404, 0.020489, 0.038974, -0.19869, 0.065939, -0.11451, 0.15766, 0.15876, -0.10153, 0.15162, 0.26821, 0.23388, -0.11493, 0.098095, 0.053563, -0.10113, 0.05531, -0.20974, -0.035791, -0.14873, -0.20049, -0.022756, 0.057507, 0.20447, -0.18627, -0.21503, -0.0044905, -0.28856, 0.031048, 0.16272, 0.067949, -0.15246, -0.019164, 0.31189, -0.010774, -0.25956, 0.016564, -0.035822, 0.077274, -0.10028, 0.31529, 0.032038, 0.25298, -0.1769, -0.14586, 0.090035, -0.059671, 0.1124, 0.3027, -0.079148, 0.21147, -0.0021538, -0.023762, 0.24101, -0.022107, -0.14914, -0.17478, 0.19457, 0.11478, -0.056655, 0.16902, -0.10203, 0.092118, -0.029558, 0.053092, 0.095661, -0.11535, 0.025039, 0.11723, -0.12198, -0.13359, -0.20374, 0.056916, 0.019352, -0.00010443, 0.13141, -0.11953, 0.032819, 0.14745, 0.048164, -0.13463, 0.10255, -0.090965, 0.12527, 0.10708, -0.1684, -0.12506, 0.14798, 0.047775, 0.027096, -0.022445, 0.064138, -0.17978, -0.19269, -0.017962, 0.33083, 0.12766, 0.10295, 0.13917, -0.24834, 0.14435, -0.12073, 0.11765, -0.086994, -0.0035333, 0.1392, 0.12856, 0.062702, -0.046897, 0.0059045, 0.23477, 0.10548, 0.017885, -0.041222, 0.078198, 0.1512, -0.071557, 0.064352, 0.02891, -0.010313, -0.21598, -0.18317, -0.0098099, -0.094472, -0.20104, 0.039202, 0.094147, 0.046894, -0.036062, -0.072277, -0.11157, -0.1067, 0.1109, -0.022301, -0.070209, -0.070016, -0.25438, 0.10335, 0.056638, 0.024858, 0.012796, 0.077072, 0.10816, -0.051854, -0.056149, -0.0028173, 0.0060163, -0.11311, -0.060675, 0.13326, -0.015193, -0.031639, 0.13717, -0.055809, 0.060995, 0.027739, 0.020689, 0.0078359, 0.18155, 0.29327, -0.2153, -0.24152, -0.025937, -0.072507, 0.14989]], ["a", [0.11559, 0.30192, -0.11465, 0.01001, -0.032187, -0.10755, 0.060674, -0.10477, 0.17488, 0.0081116, -0.02263, 0.065401, 0.1133, 0.054737, -0.06209, -0.029822, -0.16608, 0.12224, 0.045251, 0.2134, 0.027965, -0.031319, -0.25392, -0.20146, -0.19688, -0.015251, -0.27038, 0.10511, 0.074226, 0.01554, -0.014038, 0.16516, -0.17375, -0.016743, 0.013919, 0.01119, -0.12599, -0.11975, 0.079578, -0.037088, -0.071665, -0.085153, -0.1117, 0.020142, -0.161, 0.0019132, 0.13843, 0.15445, -0.026397, -0.014582, 0.00060368, -0.19382, 0.11267, 0.035035, -0.014103, 0.11427, -0.093813, -0.048103, -0.0057412, 0.18635, -0.13767, -0.25908, 0.21259, -0.18934, -0.0666, -0.36531, -0.3073, -0.05415, -0.017772, 0.053708, -0.2085, 0.043945, 0.011802, -0.043432, 0.056697, -0.087127, 0.049667, -0.0098114, 0.098693, 0.044723, 0.090933, -0.088065, 0.057724, -0.19914, 0.12831, -0.07628, -0.11602, -0.043127, -0.27085, -0.0964, 0.046104, -0.057634, 0.12419, -0.094156, 0.088391, 0.015803, 0.057685, 0.1791, -0.16668, -0.0055587, -0.28134, -0.012136, 0.13262, 0.15771, 0.023281, 0.049928, -0.1379, 0.17804, 0.032105, -0.0090514, -0.15264, -0.058656, -0.087721, 0.028901, -0.041666, -0.30451, 0.2219, -0.00363, 0.077197, 0.12785, 0.12945, 0.073578, -0.027118, 0.36309, 0.026545, -0.060575, 0.016652, 0.052824, -0.039201, 0.10092, -0.060684, 0.13919, 0.075804, 0.042375, -0.13606, -0.093351, -0.070637, -0.071629, 0.15919, 0.12709, -0.053596, 0.10054, 0.14635, -0.028849, 0.12329, 0.31595, -0.074747, -0.013792, -0.081995, -0.08413, -0.098656, 0.040794, -0.14104, -0.19548, -0.12146, 0.017467, 0.21902, 0.031789, 0.16661, 0.033612, -0.26427, 0.2818, -0.21657, 0.071942, 0.31303, -0.043565, 0.081923, 0.027802, 0.12997, -0.22937, -0.25916, -0.028432, -0.074796, -0.20992, -0.073081, 0.025689, 0.10352, 0.16966, -0.052541, -0.049782, 0.10966, 0.20609, -0.033784, 0.21358, -0.096748, 0.17156, 0.16477, -0.14704, 0.030289, 0.055128, -0.044506, -0.39971, 0.39786, 0.35765, 0.050157, -0.165, 0.15778, -0.029775, -0.16378, -0.074734, 0.13908, 0.078804, -0.07814, 0.1788, -0.20376, -0.26927, -0.16764, 0.13233, 0.07399, -0.022863, 0.19895, 0.036038, -0.090789, -0.0098625, 0.051642, -0.23021, -0.10299, -0.25354, -0.25051, -0.075135, -0.17881, -0.0019653, -0.080002, 0.21553, 0.15182, -0.020711, -0.12492, 0.11649, 0.01981, 0.073403, 0.15539, 0.026995, -0.11933, -0.030677, -0.16556, 0.092261, 0.0049417, -0.073793, -0.055393, -0.082741, -0.13011, 0.013525, 0.018191, -0.0055438, 0.058809, 0.16387, 0.15175, 0.0069439, 0.038183, -0.061297, 0.045698, -0.025712, 0.0091615, 0.021573, -0.060742, 0.10785, -0.088319, -0.12451, 0.17643, -0.069255, -0.055677, 0.2055, 0.15244, 0.016753, -0.15624, 0.039461, 0.078458, 0.089246, 0.023802, -0.25402, -0.22407, 0.079226, -0.1489, -0.0013105, -0.2294, -0.12029, 0.17867, 0.071291, 0.12154, -0.11576, 0.13246, 0.014544, 0.043274, -0.076181, 0.044143, -0.14924, 0.10415, 0.21987, -0.089499, -0.0071804, -0.020257, -0.18694, -0.065594, -0.20223, -0.12218, -0.29798, 0.034272, 0.11048, 0.13074, 0.041164]], ["is", [0.035927, 0.14517, 0.11926, 0.078836, -0.047748, 0.10096, 0.090815, -0.22176, -0.095085, -0.02261, 0.0076501, 0.04377, 0.051051, -0.097378, -0.037446, 0.045309, 0.00087634, -0.12497, 0.029659, 0.069825, -0.16091, 0.1742, -0.32899, -0.1829, -0.0065372, 0.058934, 0.019552, 0.19681, -0.14456, 0.085745, -0.071958, 0.37732, -0.34039, 0.027648, 0.012375, -0.15959, -0.14646, 0.16194, 0.092523, -0.087637, -0.059375, -0.010355, -0.074173, 0.056924, -0.10949, 0.28542, 0.19264, 0.010483, -0.05483, -0.030501, 0.068125, -0.049188, 0.11643, -0.1018, 0.10541, 0.096377, 0.30352, 0.098904, 0.16109, 0.15746, 0.085867, -0.1266, 0.086606, -0.012517, -0.060086, 0.058047, -0.19545, 0.029768, 0.1353, -0.054936, -0.09761, 0.041602, 0.19329, -0.071273, -0.4064, -0.075163, 0.037473, 0.24462, 0.068334, -0.082493, -0.046809, 0.12907, 0.085082, -0.26625, -0.089977, -0.18727, -0.19797, 0.12161, -0.12957, -0.074638, 0.26606, 0.21286, 0.13707, -0.22089, 0.061054, -0.25247, 0.12172, 0.17021, 0.14249, -0.059753, -0.22905, 0.069484, 0.075391, 0.054459, 0.025777, -0.079382, -0.23297, -0.056315, 0.085659, -0.13863, 0.010848, 0.11964, -0.29033, 0.056997, 0.10546, -0.09129, 0.15602, 0.16682, 0.19723, 0.068381, 0.25218, 0.12906, -0.11976, 0.36511, 0.04613, 0.14922, 0.11582, 0.15174, 0.066293, 0.041363, -0.11032, 0.034476, 0.087089, 0.067598, 0.020334, -0.0807, 0.11125, 0.079644, 0.1182, 0.14276, -0.16239, 0.048049, 0.20329, -0.1865, 0.068342, 0.11872, -0.21844, 0.080969, 0.11576, -0.086196, 0.016645, -0.07335, -0.017962, -0.036097, -0.013199, -0.079475, 0.11069, -0.045565, 0.53583, -0.011069, 0.081706, 0.17232, -0.2441, -0.040374, 0.32503, -0.0045183, -0.023625, -0.13361, 0.11442, 0.13294, -0.13098, -0.2013, -0.084633, 0.055785, 0.024583, -0.031059, 0.17107, 0.016382, -0.007079, -0.038921, -0.041218, 0.13561, 0.045142, 0.39547, 0.084596, 0.1296, 0.074092, 0.050129, 0.13505, -0.069099, 0.0042038, -0.19653, 0.052232, 0.21959, 0.076529, -0.13691, -0.090079, 0.039593, -0.19713, 0.088612, 0.052963, -0.15249, -0.34548, 0.074472, -0.27969, -0.074521, -0.21438, 0.14577, 0.18846, -0.12055, 0.19297, 0.089923, 0.11085, 0.23914, -0.058177, -0.15256, -0.049997, -0.29806, -0.16428, -0.053028, 0.057367, -0.12154, -0.2741, -0.12438, 0.30366, 0.0038798, -0.11727, 0.30079, -0.014037, 0.0051858, 0.014408, 0.056017, -0.24088, 0.03485, -0.1719, -0.042362, -0.17468, -0.23828, -0.018515, -0.015014, -0.21179, 0.16822, 0.12561, -0.11843, 0.29393, 0.30496, 0.36829, -0.0016441, 0.13448, -0.17843, -0.041137, 0.29053, -0.033821, -0.049843, -0.10897, 0.057659, -0.0051955, -0.12193, 0.18452, -0.043497, 0.1309, 0.32408, 0.049279, -0.12412, -0.23473, -0.065103, -0.1325, 0.36398, 0.022735, -0.15708, -0.058168, 0.11844, -0.011848, 0.043694, 0.039633, -0.26053, 0.32672, 0.17928, 0.1103, -0.045212, 0.22146, 0.15149, 0.061161, -0.055577, -0.075315, -0.10055, 0.11615, 0.19411, -0.10141, 0.21326, 0.040324, -0.2741, -0.11633, -0.089418, -0.072754, -0.26043, 0.084246, -0.0016082, 0.1708, -0.035512]], ["on", [-0.029945, 0.08308, -0.041043, 0.062259, -0.019055, -0.070495, 0.10458, -0.11022, -0.052828, -0.21471, -0.010283, 0.011255, 0.044272, -0.12704, 0.13873, -0.10672, -0.031042, -0.036724, 0.038023, 0.14331, -0.15955, -0.010396, -0.30636, 0.0018093, -0.21795, -0.19619, 0.15655, -0.26115, 0.068009, 0.0054802, 0.018274, 0.27194, -0.063782, 0.050576, -0.039229, -0.22498, -0.21599, 0.028109, 0.27633, -0.19207, 0.083086, 0.066477, -0.049566, 0.12438, -0.22175, -0.024482, 0.0092416, 0.039755, 0.030334, -0.30435, 0.059653, -0.18663, 0.052629, 0.0040435, 0.021349, -0.08179, -0.012902, 0.051812, -0.10407, 0.25295, -0.0083517, -0.21269, 0.19349, -0.25011, -0.17148, -0.25245, -0.02836, 0.009775, 0.010365, 0.20992, 0.094111, 0.045987, -0.10821, -0.12871, 0.017863, 0.016449, 0.35166, 0.2368, 0.087123, 0.0014235, 0.076331, 0.028697, 0.1874, 0.097398, 0.071689, -0.20054, -0.1518, -0.18455, 0.247, -0.24415, -0.099852, 0.22032, 0.28422, -0.26721, 0.18074, 0.141, 0.024393, -0.1074, -0.12624, -0.027884, -0.14301, -0.096826, -0.1293, -0.03152, -0.12661, -0.036811, -0.061348, 0.29519, -0.03723, 0.24504, 0.10346, -0.13672, 0.093343, -0.053711, -0.056038, 0.10644, 0.085047, 0.026389, -0.1212, 0.020749, 0.36126, 0.13563, -0.11141, 0.27515, -0.021931, -0.033346, 0.26127, 0.32768, 0.16539, 0.2657, -0.11442, -0.10774, 0.027501, 0.20596, -0.26, -0.17816, -0.0702, 0.0029366, 0.030597, 0.036969, -0.11377, 0.26168, -0.20023, -0.086989, -0.042935, 0.13088, 0.26097, 0.0067192, -0.28677, 0.2712, -0.25236, -0.2575, -0.39759, 0.017236, 0.15021, -0.17865, -0.061733, -0.078715, 0.13485, -0.11931, -0.1454, 0.10977, -0.25129, 0.12937, 0.23836, 0.1737, -0.046556, -0.083078, 0.12602, -0.14134, -0.27256, 0.19661, -0.26557, -0.17845, -0.18839, -0.044315, -0.051716, 0.066204, 0.14214, -0.047498, -0.17975, 0.024502, 0.089698, 0.023657, 0.1227, 0.3495, 0.14525, -0.17002, 0.12992, -0.036131, 0.013646, -0.2935, 0.021192, 0.027402, -0.035963, 0.030356, 0.036936, 0.10434, -0.34108, -0.22907, -0.10944, 0.18918, -0.06642, -0.047107, 0.038047, -0.13913, 0.065176, -0.062903, 0.31345, -0.090358, 0.44221, 0.088019, -0.085611, 0.031707, 0.0027451, 0.21896, 0.0056458, -0.45227, -0.11961, -0.12665, 0.23553, -0.089455, -0.031027, 0.14073, -0.13621, 0.025762, -0.23421, 0.04172, 0.026577, 0.14901, 0.35331, 0.16014, -0.0858, 0.10075, 0.11963, 0.083981, -0.0085175, -0.10134, 0.025867, 0.0019921, 0.11903, 0.090903, 0.31105, 0.093143, 0.26736, 0.29493, 0.03174, -0.06166, 0.25909, 0.25553, 0.21146, -0.036734, 0.1269, 0.040165, -0.15194, 0.12897, -0.49793, -0.0030868, -0.062966, 0.090043, 0.34313, 0.17949, -0.11345, 0.14079, 0.073598, -0.15301, -0.046048, 0.14508, -0.25676, -0.1302, -0.10335, -0.053122, 0.042721, 0.24057, -0.18248, -0.14799, 0.01282, 0.26499, 0.038375, -0.041837, 0.22512, 0.082875, -0.21517, 0.1009, 0.11119, -0.096562, 0.07562, -0.078081, 0.15468, -0.19181, 0.14994, -0.044552, -0.11669, -0.17937, 0.36259, -0.16617, 0.13773, 0.036366, -0.048136, 0.0014706]], ["s", [0.038464, -0.11291, -0.17323, -0.03041, 0.15791, -0.019141, 0.0019244, -0.11037, -0.076457, 0.12753, 0.11781, -0.13902, 0.099159, 0.1102, 0.064557, 0.086609, 0.0032735, -0.0087435, -0.17398, 0.054122, -0.28031, 0.18313, -0.069872, -0.19947, -0.17661, -0.017548, -0.049704, -0.015239, -0.016797, 0.19059, -0.16898, 0.52075, -0.14446, 0.057708, -0.070047, -0.13201, -0.085839, 0.019588, 0.18062, -0.37744, 0.20453, 0.018589, -0.23324, 0.15698, 0.13667, -0.1235, 0.030655, 0.20784, 0.16087, 0.17465, 0.063654, -0.065543, 0.096355, -0.094331, -0.25684, 0.18813, 0.057432, -0.073132, 0.0077761, 0.11959, 0.12944, -0.25971, 0.13682, -0.016024, -0.37095, 0.066671, 0.08206, -0.10501, 0.11285, -0.038756, 0.16821, -0.072626, -0.051393, -0.3861, -0.13619, -0.11603, 0.12859, 0.17121, 0.03961, -0.081267, 0.1959, 0.056111, 0.091625, 0.043701, -0.18668, 0.033272, -0.13498, 0.4151, -0.25299, -0.18425, -0.014946, -0.038079, 0.16609, -0.0064121, 0.066091, 0.02267, 0.043807, 0.060552, 0.080007, -0.17192, -0.13464, 0.005538, 0.068381, 0.04762, -0.23787, -0.12178, -0.17201, 0.22628, 0.17626, 0.14631, 0.0043271, -0.036512, -0.12546, -0.016598, 0.0025892, 0.14845, 0.14535, 0.23339, 0.058385, 0.084762, 0.099059, 0.15039, 0.18396, -0.040558, 0.164, 0.01755, 0.12023, 0.13814, -0.15704, 0.039937, 0.161, 0.25549, 0.18153, 0.020778, -0.09425, -0.10346, -0.28616, 0.044853, -0.070123, 0.01281, -0.051044, -0.094495, -0.15318, 0.041003, -0.093269, 0.16232, 0.2233, 0.034059, -0.055275, -0.039754, -0.072807, 0.056499, -0.14058, -0.044182, -0.16488, 0.052832, 0.086518, -0.076868, -0.039924, 0.27809, -0.1243, 0.20393, 0.0011994, 0.25289, 0.14898, 0.033952, 0.15503, 0.053445, 0.2614, -0.045747, -0.084473, -0.14395, -0.18902, -0.13388, -0.12626, 0.13108, -0.019506, -0.024184, -0.036778, -0.13597, 0.22259, -0.040843, 0.095631, 0.21741, -0.21438, -0.023312, 0.1467, -0.16684, 0.23378, 0.094925, 0.020536, -0.060983, 0.085806, 0.10767, -0.076936, -0.061339, 0.0067582, -0.050502, -0.34804, 0.050146, 0.015361, -0.061954, 0.010673, 0.071738, 0.06038, -0.31371, -0.043667, 0.057637, 0.14199, 0.059277, 0.51126, -0.14883, -0.036146, -0.12154, 0.041745, -0.11368, 0.13902, -0.36065, -0.14418, 0.033538, -0.23366, -0.072889, -0.21204, 0.066125, -0.19825, -0.0301, -0.091775, -0.061682, -0.054451, -0.069563, 0.031283, 0.18651, 0.040566, -0.1524, -0.13553, 0.25094, 0.16633, -0.060563, -0.037528, -0.10264, -0.075712, 0.064021, 0.05656, 0.055054, 0.12962, 0.081269, 0.098875, 0.13312, 0.019775, 0.093859, 0.13799, 0.066917, 0.12089, 0.14025, 0.057053, -0.021536, -0.11202, -0.15134, 0.012022, 0.0008462, 0.18794, -0.022936, 0.12724, 0.14248, -0.015237, -0.075361, 0.15065, 0.11984, 0.16618, -0.35692, -0.2474, 0.091957, 0.042723, 0.21117, -0.072008, -0.064827, 0.39984, 0.27504, 0.26081, 0.036257, -0.00092725, 0.097138, 0.11537, -0.087621, 0.14525, 0.19174, -0.030003, 0.21575, 0.032843, -0.28628, 0.0061119, -0.10856, 0.040474, -0.12915, -0.15099, -0.30803, 0.00945, 0.18243, -0.071865, 0.094051]], ["as", [-0.10668, -0.036518, -0.1063, 0.063468, 0.11089, 0.056798, 0.19817, -0.00047669, 0.1151, 0.12766, 0.025721, -0.096167, 0.084847, -0.20034, 0.16011, -0.13566, 0.12913, -0.036482, -0.0013579, 0.0052643, -0.18697, 0.15282, -0.085003, -0.16923, -0.045447, -0.031521, -0.042384, -0.11903, -0.053743, 0.0077491, -0.10079, -0.0014938, -0.23998, 0.20515, -0.023961, 0.03907, -0.050253, 0.013688, 0.07491, -0.31991, -0.079342, 0.14457, -0.15161, 0.0047635, -0.095498, -0.12307, -0.085301, 0.25123, 0.27485, -0.022108, -0.038877, 0.083706, -0.02285, 0.079031, -0.084699, -0.015823, 0.030432, 0.0046942, -0.23436, 0.2158, 0.042915, -0.16513, 0.078436, -0.2917, -0.021577, -0.045501, 0.0078394, -0.19502, -0.1083, -0.01386, -0.25153, -0.036888, -0.038306, -0.21965, -0.016194, -0.1347, 0.12681, 0.11563, 0.20419, -0.10326, 0.26979, 0.040638, -0.079217, -0.1489, 0.039404, -0.18841, -0.081222, 0.20854, -0.42372, -0.092842, 0.02847, -0.064213, 0.12222, -0.086276, 0.16448, -0.029391, -0.089828, 0.12399, -0.2145, 0.059643, 0.016001, -0.27254, 0.17223, -0.05487, -0.04919, -0.0075199, -0.089158, -0.0049213, 0.10274, -0.21427, 0.019886, -0.10638, -0.22215, -0.027423, 0.08864, -0.013108, 0.16812, 0.058269, -0.029014, -0.13752, 0.20446, 0.16461, -0.25531, 0.24799, -0.17534, -0.1073, 0.12386, 0.16596, -0.025096, 0.060844, -0.06466, 0.13571, -0.035465, 0.084584, 0.11602, 0.12394, -0.1146, 0.009226, 0.024469, 0.21552, -0.086623, 0.058701, -0.03065, -0.11282, 0.21441, 0.20956, -0.053683, 0.17708, -0.040871, -0.068884, -0.039507, -0.082237, 0.026662, 0.002197, -0.17169, 0.17174, -0.17123, 0.0026961, 0.32867, 0.11802, -0.20242, 0.064288, -0.27296, 0.17342, 0.10837, -0.19019, -0.088144, -0.31898, 0.13042, 0.25379, -0.18172, -0.003441, -0.2074, -0.17084, -0.18809, -0.067014, -0.0077843, 0.12018, 0.055609, 0.062902, 0.051946, 0.032556, 0.064706, 0.16043, 0.010894, 0.26701, 0.15682, -0.19018, 0.17844, 0.037642, -0.094117, -0.2792, 0.0062504, 0.20934, 0.15969, -0.005166, 0.029639, -0.034127, -0.15754, 0.08945, -0.12987, 0.15607, -0.0063243, 0.15625, 0.17861, -0.12055, -0.20331, 0.19912, 0.084713, 0.10501, 0.52838, -0.076569, -0.10239, 0.11299, -0.029849, -0.077256, 0.063675, -0.20756, -0.06305, -0.042499, -0.041598, 0.02283, -0.21428, 0.046132, -0.050075, -0.22019, -0.021104, -0.064426, 0.014369, 0.058189, 0.20217, 0.11436, -0.072824, -0.12266, -0.20333, 0.27137, 0.13923, 0.055401, -0.0066487, -0.0019663, 0.14431, 0.16829, -0.066634, 0.20795, 0.13077, 0.081666, 0.076304, -0.14139, 0.025815, 0.020766, 0.152, 0.019461, -0.079617, 0.11885, -0.032576, 0.12693, -0.15425, -0.19208, -0.089979, -0.18192, -0.076191, 0.096308, 0.084752, -0.077118, -0.15407, -0.40903, -0.2408, 0.27727, 0.070015, -0.23642, -0.26462, 0.09025, -0.083525, -0.055758, -0.0044354, -0.18702, 0.34108, 0.17177, 0.039009, 0.014808, 0.20067, 0.014752, 0.03399, 0.046347, -0.055452, -0.04778, -0.0083971, 0.29187, 0.2087, 0.04187, -0.085302, 0.017596, 0.038921, -0.042198, -0.11009, -0.11966, -0.032105, -0.0087815, -5.7399e-05, 0.13576]], ["by", [-0.13167, -0.040817, -0.23956, 0.23064, -0.12696, 0.11678, 0.10581, -0.20413, 0.0080369, 0.23646, -0.054108, 0.12133, -0.15008, 0.11509, 0.11896, -0.25209, 0.10367, -0.065059, -0.080371, 0.12708, -0.014658, 0.2269, -0.28552, -0.096679, 0.063329, -0.033706, 0.01759, 0.028157, 0.15469, 0.033508, -0.23307, 0.091283, 0.023145, 0.13172, 0.2012, -0.080005, -0.25302, 0.003297, 0.23424, -0.094455, 0.065775, -0.0028773, 0.00034232, 0.19717, 0.033452, -0.20442, 0.0010543, -0.010863, -0.15341, 0.065852, 0.12561, -0.040625, -0.27178, -0.024283, 0.080334, 0.022827, -0.097376, 0.18855, 0.011054, 0.038045, -0.02144, -0.21974, 0.0035103, 0.20461, -0.0075506, 0.16733, -0.10361, -0.18865, 0.031286, -0.081821, -0.11796, -0.0090501, -0.16731, -0.27503, 0.047636, -0.033096, 0.11845, 0.14352, 0.15145, -0.047157, -0.099036, 0.042062, 0.17922, 0.22662, -0.081016, -0.066303, -0.19108, 0.092628, 0.0024941, -0.065267, -0.14996, -0.11355, -0.078145, -0.13441, 0.29873, -0.060622, 0.1054, -0.11155, 0.026942, 0.048895, -0.10103, -0.010862, 0.24963, -0.087945, -0.099125, -0.1148, 0.1452, -0.11545, 0.33225, -0.14523, 0.077605, -0.099609, -0.068166, -0.050334, 0.049693, 0.17082, 0.283, 0.3763, 0.0020146, 0.14755, 0.07047, 0.31503, -0.47475, 0.38828, 0.058978, 0.0626, 0.14044, 0.1298, 0.12159, 0.1261, 0.19995, 0.23574, 0.13194, 0.25251, 0.37902, -0.0049426, 0.10706, -0.016369, -0.12881, 0.04987, 0.25352, 0.12318, 0.17736, -0.20315, -0.21117, 0.099453, 0.017912, 0.019938, -0.015746, 0.20934, 0.071116, -0.1477, -0.14592, -0.11236, -0.094642, -0.16884, -0.16842, -0.072051, 0.17637, 0.101, -0.10587, -0.086128, 0.024187, 0.011435, 0.3069, -0.071507, 0.17903, 0.11991, 0.28315, -0.0010412, -0.18539, 0.19078, -0.093839, 0.061669, -0.10506, -0.028498, 0.01504, 0.17677, -0.0046986, -0.1237, -0.11957, -0.33566, -0.35805, 0.17801, 0.09083, 0.21286, 0.013965, -0.28891, 0.056233, 0.021966, -0.094326, -0.36791, 0.23437, -0.082501, 0.13699, -0.41778, -0.21958, -0.10984, -0.16532, 0.032684, 0.087233, 0.2412, -0.21436, 0.019845, -0.063727, -0.073478, -0.21645, 0.20205, 0.21141, -0.03102, 0.573, -0.032144, 0.039847, -0.05959, -0.0036714, 0.070425, 0.15985, 0.031499, -0.18282, -0.036042, -0.01486, -0.39543, -0.40932, -0.027014, -0.042265, -0.047627, -0.28248, -0.19428, -0.019236, 0.24395, -0.21907, 0.011405, -0.12631, 0.14487, -0.036576, -0.062648, -0.0084789, 0.076445, -0.005565, -0.12415, -0.07852, -0.14686, 0.12963, -0.11216, -0.0012184, 0.027598, 0.017539, -0.2169, 0.15463, 0.14615, 0.12645, 0.0058155, 0.1358, -0.22443, -0.21958, 0.2109, -0.0985, -0.066894, -0.17394, 0.017303, 0.19829, -0.098625, -0.03713, -0.044018, -0.23748, -0.21127, -0.023497, -0.13315, 0.011752, 0.001701, -0.15698, 0.078147, 0.027263, -0.17181, -0.15723, -0.23723, 0.22997, 0.35097, 0.092508, -0.021858, 0.00041802, 0.129, -0.028015, 0.031211, -0.067224, 0.087442, -0.027041, 0.24614, -0.17322, -0.036277, 0.32144, -0.23934, 0.13895, -0.014339, -0.068493, -0.066417, 0.18929, 0.32907, -0.11879, 0.0031042]], ["it", [-0.3366, 0.13889, -0.068331, 0.0079146, -0.020023, 0.093429, 0.10182, -0.2151, -0.18844, 0.15148, -0.14284, -0.11377, 0.11161, -0.23444, 0.028262, -0.062042, 0.21756, 0.095647, 0.1698, 0.071679, -0.054375, -0.046085, -0.21987, -0.27494, -0.25339, -0.10972, -0.0070419, 0.03357, 0.12896, 0.18848, -0.25815, 0.17061, -0.38947, 0.3481, -0.041047, -0.12456, -0.086325, -0.19126, 0.022593, -0.12725, -0.13036, 0.098136, -0.2339, 0.008161, 0.18667, 0.20999, 0.063713, -0.028508, -0.054716, -0.11117, -0.010525, 0.0070143, -0.0041469, -0.036819, -0.0036929, 0.078406, 0.0038262, 0.26416, -0.06283, 0.22119, 0.062652, -0.14575, 0.18947, -0.098799, -0.038427, -0.24093, -0.10867, -0.089518, 0.12916, 0.059777, -0.015123, 0.14633, 0.032212, -0.15511, -0.17298, 0.08858, -0.081538, 0.27585, -0.040939, 0.15529, -0.083451, -0.070103, 0.1548, 0.19894, -0.094732, 0.11057, -0.18328, 0.00019708, 0.032517, -0.076038, 0.051504, 0.18083, 0.25092, -0.15933, 0.1487, 0.12631, 0.15929, 0.17724, 0.013187, -0.0839, -0.22055, -0.01915, 0.1156, -0.010974, -0.12785, -0.19002, -0.22735, 0.013581, 0.10532, 0.053416, -0.03142, 0.04568, -0.079156, 0.075019, -0.19182, -0.040826, 0.34173, 0.17852, 0.10964, 0.0099851, 0.2074, 0.10894, -0.17686, 0.47952, 0.15701, 0.11366, 0.15475, 0.098568, 0.090232, 0.18289, -0.062892, 0.012882, -0.11289, 0.047716, 0.043811, 0.0065159, 0.032541, 0.28292, 0.061777, 0.17045, 0.047034, 0.17219, 0.10032, 0.11206, -0.019359, 0.070779, -0.024869, 0.036909, -0.08589, 0.18344, 0.10946, -0.05685, 0.096464, -0.16475, -0.055801, -0.15339, 0.073, -0.081217, 0.23755, 0.069371, -0.16822, 0.22798, -0.37593, 0.034761, 0.15086, 0.031813, -0.069746, -0.08961, 0.12988, -0.012923, -0.024002, -0.25414, -0.19594, -0.15103, -0.21644, 0.045066, -0.16032, 0.0044476, 0.1035, 0.14202, 0.18504, 0.0066014, 0.13737, 0.13789, -0.043577, 0.032058, 0.068189, -0.14007, 0.10683, -0.0096826, -0.043681, -0.16244, 0.11275, 0.3178, -0.070198, 0.11798, 0.19411, 0.026728, -0.29832, 0.11729, 0.064688, 0.07844, -0.059657, 0.21912, -0.013091, -0.2641, -0.10992, 0.12463, 0.13129, 0.066074, 0.18305, 0.10516, 0.15296, 0.040073, 0.16806, 0.043346, 0.038122, -0.21098, 0.072374, 0.10674, -0.057004, -0.16355, -0.0067051, -0.13049, 0.24781, -0.083042, -0.24073, -0.11134, -0.0094638, 0.098692, 0.20597, 0.17607, -0.20891, 0.0030144, -0.12683, 0.087142, -0.036535, -0.14635, -0.11332, 0.043924, -0.023122, -0.041063, 0.2974, -0.16771, 0.13906, 0.13147, 0.17896, -0.017101, 0.052858, -0.059781, 0.11522, 0.2598, -0.18943, -0.062224, 0.034479, 0.0072344, 0.078014, -0.15113, 0.17729, -0.11423, 0.087861, 0.078173, -0.11313, -0.19613, -0.051441, -0.037768, -0.15843, 0.24705, -0.00826, -0.31003, -0.34136, 0.10744, -0.024086, 0.081787, -0.0024878, -0.23679, 0.21343, 0.18235, 0.10686, -0.22907, 0.18638, 0.015871, -0.24017, -0.20794, 0.062498, -0.28062, 0.052488, 0.14059, 0.0051189, -0.048301, 0.14975, -0.060221, -0.063074, -0.077547, 0.045633, -0.15038, -0.026861, 0.14517, 0.029054, 0.074989]], ["at", [0.084657, -0.22584, 0.096451, 0.10084, -0.32227, 0.06084, -0.14098, 0.042526, 0.25177, -0.15139, 0.28946, -0.22224, 0.14715, 0.21937, 0.017641, -0.075882, -0.054542, -0.019967, 0.023136, 0.34317, 0.19269, 0.06061, -0.41196, -0.14237, -0.11288, -0.19504, 0.10921, -0.065239, 0.17814, 0.22521, -0.14425, 0.19108, -0.051249, 0.3514, -0.033516, -0.10391, -0.15866, -0.04648, 0.26894, -0.054653, 0.026268, 0.024519, -0.153, 0.0089207, -0.10311, -0.061886, -0.076662, 0.16422, 0.19202, -0.15849, -0.10444, -0.32162, -0.017646, 0.19714, 0.063879, 0.15029, 0.27939, 0.20403, -0.11719, 0.11302, 0.21741, -0.23783, 0.22149, -0.099384, -0.15909, -0.23008, -0.16896, 0.048093, -0.34688, 0.077259, 