{"data":{"allFile":{"edges":[{"node":{"childMarkdownRemark":{"html":"<p align=\"center\">\n  <a href=\"https://aida.dor.ai\">\n    <span class=\"gatsby-resp-image-wrapper\" style=\"position: relative; display: block; margin-left: auto; margin-right: auto;  max-width: 180px;\">\n    <span class=\"gatsby-resp-image-background-image\" style=\"padding-bottom: 100%; position: relative; bottom: 0; left: 0; background-image: url(&apos;data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAUCAYAAACNiR0NAAAACXBIWXMAABjqAAAY6gG/LxVHAAACXElEQVQ4y52UTYsTQRCGJ5kFF0RPiuLdu0dhD172KEyymxVRf8CCK+hFEfEDxQ/0FwgGvU12N+tHBEHBqyCov8Cj4M2TmO6ZJONT09Wd3hWDa+BNVXdXv/1WdU0nyYxfq2e9bWS5bfi5Vm5nbSqSrGcCgYMJm1hr+Fjvy5ogyw0IcTVXrEKIUtDEb6qdU4ITYFHj5tyai8vqPVP121KbkfpxsPgv5YkVzmc9ex0lz0jlCeMu6XRR8hh/HWyp323lNYgxT7GP2HfQ17pOUwdnT7+rqs6rqloZYAeRj+28xH+t/sDNLzN35n1Vsfea44CLE5pKeEECsEMWCuy43WecmxF+CbCmbG9OJGaiMcOO2/PA1drUCvcwcUAI5fR683op9if4RNqW25OxEtkv4Ed7YyTjQpRi7zoOs1dYjzB4C66IQupRLL+QIPMZsn3Mf1dVlSo9xJ7nHUdkpAzYO8QO2HNM+mc/Exm4pAqtI7QftRTflvpVTEjb2FyJhmpF4UkIDydRD52XUzmpWNqS2tmvzK249MaeUOp5DnzQQ42mfF8vJYlveS3UUGpFHd248LUT1HPtzbGfK5Xwnn4tqfvbRmhKH4xv9IASxWUmQJVchsYNVcTDadv0bBqnrMEjuSDfi3+DxEjvSodECgPhmutDM9be6vPFXEXZLfybO8G+G6zfxl8lZj58dUFhbldPvamJJqR2MdnlL/qWQw0vg19gQeebEKeokNfkT8iae2nS8ITlNonbZoGgo/6J8kHTN3InTPD1s4tU5tNH1JcgnLjr3PPwWjemao1cVvI/v9/U/81QXj2DwAAAAABJRU5ErkJggg==&apos;); background-size: cover; display: block;\"></span>\n    <img class=\"gatsby-resp-image-image\" style=\"width:100%;height:100%;margin:0;vertical-align:middle;position:absolute;top:0;left:0;box-shadow:inset 0px 0px 0px 400px white;\" alt=\"Aida\" title src=\"/static/2c3e064d27ddf667cdc016d5c5c99793/b059c/icon.png\" srcset=\"/static/2c3e064d27ddf667cdc016d5c5c99793/cf440/icon.png 148w,\n/static/2c3e064d27ddf667cdc016d5c5c99793/b059c/icon.png 180w\" sizes=\"(max-width: 180px) 100vw, 180px\">\n  </span>\n  </a>\n</p>\n<h1 align=\"center\">\n  Aida\n</h1>\n<p align=\"center\">\n  <strong>Build simple conversational assistants, chatbots, and more.</strong><br>\n  Simple deep learning language models that can train and predict from the browser, nodejs and python.\n</p>\n<h3 align=\"center\">\n  <a href=\"https://aida.dor.ai/demo\">\n    Demo\n  </a> | \n  <a href=\"https://aida.dor.ai/train\">\n    Train an assistant\n  </a> | \n  <a href=\"https://aida.dor.ai/overview\">\n    Technical overview\n  </a>\n</h3>\n<hr />\n<br/>\n<div>\n  <h2>Getting started</h2>\n  <h3>Aida is an experimental library for building natural language predictive models. It can help you build a simple chatbot, mood detector and other similar tasks.  with this design principles:</h3>\n  <ul>\n      <li>\n          <strong>Easy to use:</strong> Getting started by creating a dataset and training couldn't be easier thanks to&nbsp;\n          <a href=\"https://rodrigopivi.github.io/Chatito\" target=\"_blank\">\n              Chatito\n          </a>\n          , you can create a large dataset in minutes, and start training without any setup, just from the browser.\n      </li>\n        <li>\n          <strong>Low memory consumption:</strong> Having small file size and memory consumption is very important to be able to predict from the browser and mobile devices. The language embeddings give up some information and performance by not using a full word dictionary, instead the model uses pre-trained word character bigrams provided by\n          <a href=\"https://fasttext.cc/\" target=\"_blank\">\n              fastText\n          </a>, to overcome this problem and get good predictive performance, it is required additional training examples, that is why a generative scripting language is provided to overcome this problem (Chatito DSL).\n      </li>\n      <li>\n          <strong>Accurate:</strong> Although the model throws away some information by using bigrams to compose words instead of using full words, the models are able to get to good prediction rates given more data to learn from.\n      </li>\n      <li>\n          <strong>Universal application:</strong> The trained models should be able to run from multiple environments, that is why the\n          models have two mirror implementations: in&nbsp;\n          <a href=\"https://js.tensorflow.com/\" target=\"_blank\">\n              TensorflowJS\n          </a>\n          &nbsp;to be able to train and run from the browser or NodeJs, and &nbsp;\n          <a href=\"https://keras.io/\" target=\"_blank\">\n              Keras\n          </a> for Python.\n      </li>\n      <li>\n          <strong>Offline support:</strong> It should be able to train and make predictions without connectivty, no need to have a server-side api, although the trained models can also run server-side behind an api if desired. (TODO: add example running as AWS Lambda function)\n      </li>\n  </ul>\n</div>\n<h2><a href=\"https://aida.dor.ai/demo\">Check the demo</a></h2>\n<p>It's a chatbott running from the browser using Tensorflow.js and using the Web Speech API for speach to text and text to speach.</p>\n<h2>Train from the browser</h2>\n<p>You can train from the browser <a href=\"https://aida.dor.ai/train\">using Javascript and Tensorflow.js</a> (using your local GPU resources) or from the browser <a href=\"https://colab.research.google.com/drive/1nzjxR7w2X99qlxjSD4pGOWksMLqK0eqZ\">using Python and Keras</a> thanks to Google Colaboratory's free TPU's. There is no need to setup a local environment to start training your own conversational assistant.</p>\n<h2>Local setup and training</h2>\n<p>Alternatively to thhe online training experience. You can also setup a local environment.</p>\n<ol>\n<li>\n<p>Clone the GH proejct and install dependencies:</p>\n<ul>\n<li>Run <code>npm install</code> from the <code>./typescript</code> directory</li>\n<li>Run <code>pip3 install -r requirements.txt</code> from the <code>./python</code> directory</li>\n</ul>\n</li>\n<li>\n<p>Edit or create the chatito files inside <code>./typescript/examples/en/intents</code> to customize the dataset generation as you need.</p>\n</li>\n<li>\n<p>From <code>./typescript</code> run <code>npm run dataset:en:process</code>. This will generate many files at the <code>./typescript/public/models</code> directory. The dataset, the dataset parameters, the testing parameters and the embeddings dictionary. You can further inspect those generated files to make sence of their content. (Note: Aida also supports spanish language, if you need other language you can add if you first download the fastText embeddings for that language).</p>\n</li>\n<li>\n<p>You can start training from 3 local environments:</p>\n<ul>\n<li>\n<p>From python: just open <code>./python/main.ipynb</code> with jupyter notebook or jupyter lab. Python will load your custom settings generated at step 3. After running the notebook, convert the models to tensorflow.js web format running <code>npm run python:convert</code> from the <code>./typescript</code> directory.</p>\n</li>\n<li>\n<p>From web browsers: from <code>./typescript</code> run <code>npm run web:start</code>. Then navigate to <code>http://localhost:8000/train</code> for the training web UI. After training, downloading the model to the <code>./typescript/public/pretrained/web</code> directory.</p>\n</li>\n<li>\n<p>From node.js: from <code>./typescript</code> run <code>npm run node:start</code>.</p>\n</li>\n</ul>\n<p>NOTE: After training (and converting for python), the models should be available at <code>./typescript/public/pretrained</code> with a custom directory for each platform:</p>\n</li>\n</ol>\n<h2>Technical Overview</h2>\n<p>Read the <a href=\"https://aida.dor.ai/overview\">technical overview documentation</a>.</p>\n<h2>TODO</h2>\n<ul>\n<li><a href=\"https://arxiv.org/abs/1801.06146\">Universal Language Model Fine-tuning for Text Classification</a> <a href=\"http://nlp.fast.ai/classification/2018/05/15/introducting-ulmfit.html\">(blog post)</a>- ULMFiT is the current state of the art for NLP tasks.</li>\n</ul>\n<h1><a href=\"https://www.patreon.com/bePatron?u=13643440\">Donate</a></h1>\n<p>Designing and maintaining aida takes time and effort, if it was usefull for you, please consider making a donation and share the abundance. <a href=\"https://www.patreon.com/bePatron?u=13643440\">Become a Patron!</a></p>\n<h1>Author and maintainer</h1>\n<p>Rodrigo Pimentel</p>\n<h1>License</h1>\n<p>The code is open sourced under the BSD-3-Clause license, please contact me if you want to use the code under a less restrictive license.</p>\n<p>Copyright 2019 Rodrigo Pimentel</p>\n<p>Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:</p>\n<ol>\n<li>\n<p>Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.</p>\n</li>\n<li>\n<p>Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.</p>\n</li>\n<li>\n<p>Neither the name of the copyright holder nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.</p>\n</li>\n</ol>\n<p>THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.</p>"}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}