{"modelTopology":{"class_name":"Model","config":{"name":"model2","layers":[{"name":"embedded_words","class_name":"InputLayer","config":{"batch_input_shape":[null,21,300],"dtype":"float32","sparse":false,"name":"embedded_words"},"inbound_nodes":[]},{"name":"embedded_intent","class_name":"InputLayer","config":{"batch_input_shape":[null,7],"dtype":"float32","sparse":false,"name":"embedded_intent"},"inbound_nodes":[]},{"name":"nerConv1","class_name":"Conv1D","config":{"filters":128,"kernel_initializer":{"class_name":"RandomNormal","config":{"mean":0,"stddev":0.05,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1],"strides":[1],"padding":"valid","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"nerConv1","trainable":true,"batch_input_shape":[null,21,300],"dtype":"float32"},"inbound_nodes":[[["embedded_words",0,0,{}]]]},{"name":"repeat_vector_RepeatVector1","class_name":"RepeatVector","config":{"n":21,"name":"repeat_vector_RepeatVector1","trainable":true},"inbound_nodes":[[["embedded_intent",0,0,{}]]]},{"name":"nerConv2","class_name":"Conv1D","config":{"filters":128,"kernel_initializer":{"class_name":"RandomNormal","config":{"mean":0,"stddev":0.05,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1],"strides":[1],"padding":"valid","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"nerConv2","trainable":true},"inbound_nodes":[[["nerConv1",0,0,{}]]]},{"name":"concatenate_Concatenate3","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate3","trainable":true},"inbound_nodes":[[["repeat_vector_RepeatVector1",0,0,{}],["embedded_words",0,0,{}],["nerConv2",0,0,{}]]]},{"name":"bidirectional_Bidirectional1","class_name":"Bidirectional","config":{"merge_mode":null,"layer":{"class_name":"LSTM","config":{"units":100,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"bidi_encoder","trainable":true}},"name":"bidirectional_Bidirectional1","trainable":true},"inbound_nodes":[[["concatenate_Concatenate3",0,0,{}]]]},{"name":"attention_weight","class_name":"TimeSeriesAttention","config":{"name":"attention_weight","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional1",0,0,{}]]]},{"name":"concatenate_Concatenate4","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate4","trainable":true},"inbound_nodes":[[["attention_weight",0,0,{}],["bidirectional_Bidirectional1",0,0,{}],["bidirectional_Bidirectional1",0,1,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":5,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["concatenate_Concatenate4",0,0,{}]]]}],"input_layers":[["embedded_intent",0,0],["embedded_words",0,0]],"output_layers":[["dense_Dense2",0,0]]},"keras_version":"tfjs-layers 0.8.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"nerConv1/kernel","shape":[1,300,128],"dtype":"float32"},{"name":"nerConv1/bias","shape":[128],"dtype":"float32"},{"name":"nerConv2/kernel","shape":[1,128,128],"dtype":"float32"},{"name":"nerConv2/bias","shape":[128],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/forward_bidi_encoder/kernel","shape":[435,400],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/forward_bidi_encoder/recurrent_kernel","shape":[100,400],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/forward_bidi_encoder/bias","shape":[400],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_bidi_encoder/kernel","shape":[435,400],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_bidi_encoder/recurrent_kernel","shape":[100,400],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_bidi_encoder/bias","shape":[400],"dtype":"float32"},{"name":"attention_weight/att_dense1/kernel","shape":[100,100],"dtype":"float32"},{"name":"attention_weight/att_dense1/bias","shape":[100],"dtype":"float32"},{"name":"attention_weight/att_dense2/kernel","shape":[100,100],"dtype":"float32"},{"name":"attention_weight/att_dense2/bias","shape":[100],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[300,5],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[5],"dtype":"float32"}]}]}