{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"TimeDistributed","config":{"layer":{"class_name":"Embedding","config":{"input_dim":750,"output_dim":300,"embeddings_initializer":{"class_name":"PreSavedEmbeddingsInitializer","config":{}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":true,"input_length":[25],"name":"embedding_Embedding1","trainable":false,"batch_input_shape":[null,25]}},"name":"time_distributed_TimeDistributed1","trainable":false,"batch_input_shape":[null,22,25],"dtype":"float32"}},{"class_name":"CombineNgramsLayer","config":{"name":"combine_ngrams_layer_CombineNgramsLayer1","trainable":true}}],"keras_version":"tfjs-layers 0.7.5","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"time_distributed_TimeDistributed1/embeddings","shape":[750,300],"dtype":"float32"}]}]}