{"modelTopology":{"class_name":"Model","config":{"name":"model2","layers":[{"name":"embedded_words","class_name":"InputLayer","config":{"batch_input_shape":[null,21,300],"dtype":"float32","sparse":false,"name":"embedded_words"},"inbound_nodes":[]},{"name":"classConv1","class_name":"Conv1D","config":{"filters":128,"kernel_initializer":{"class_name":"RandomNormal","config":{"mean":0,"stddev":0.05,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[2],"strides":[1],"padding":"valid","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"classConv1","trainable":true,"batch_input_shape":[null,21,300],"dtype":"float32"},"inbound_nodes":[[["embedded_words",0,0,{}]]]},{"name":"classConv2","class_name":"Conv1D","config":{"filters":128,"kernel_initializer":{"class_name":"RandomNormal","config":{"mean":0,"stddev":0.05,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[4],"strides":[1],"padding":"valid","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"classConv2","trainable":true,"batch_input_shape":[null,21,300],"dtype":"float32"},"inbound_nodes":[[["embedded_words",0,0,{}]]]},{"name":"classConv3","class_name":"Conv1D","config":{"filters":128,"kernel_initializer":{"class_name":"RandomNormal","config":{"mean":0,"stddev":0.05,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[8],"strides":[1],"padding":"valid","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"classConv3","trainable":true,"batch_input_shape":[null,21,300],"dtype":"float32"},"inbound_nodes":[[["embedded_words",0,0,{}]]]},{"name":"max_pooling1d_MaxPooling1D1","class_name":"MaxPooling1D","config":{"pool_size":[20],"padding":"valid","strides":[20],"name":"max_pooling1d_MaxPooling1D1","trainable":true},"inbound_nodes":[[["classConv1",0,0,{}]]]},{"name":"max_pooling1d_MaxPooling1D2","class_name":"MaxPooling1D","config":{"pool_size":[18],"padding":"valid","strides":[18],"name":"max_pooling1d_MaxPooling1D2","trainable":true},"inbound_nodes":[[["classConv2",0,0,{}]]]},{"name":"max_pooling1d_MaxPooling1D3","class_name":"MaxPooling1D","config":{"pool_size":[14],"padding":"valid","strides":[14],"name":"max_pooling1d_MaxPooling1D3","trainable":true},"inbound_nodes":[[["classConv3",0,0,{}]]]},{"name":"concatenate_Concatenate1","class_name":"Concatenate","config":{"axis":1,"name":"concatenate_Concatenate1","trainable":true},"inbound_nodes":[[["max_pooling1d_MaxPooling1D1",0,0,{}],["max_pooling1d_MaxPooling1D2",0,0,{}],["max_pooling1d_MaxPooling1D3",0,0,{}]]]},{"name":"flatten_Flatten1","class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1",0,0,{}]]]},{"name":"dropout_Dropout1","class_name":"Dropout","config":{"rate":0.5,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true},"inbound_nodes":[[["flatten_Flatten1",0,0,{}]]]},{"name":"flatten_Flatten2","class_name":"Flatten","config":{"name":"flatten_Flatten2","trainable":true},"inbound_nodes":[[["max_pooling1d_MaxPooling1D1",0,0,{}]]]},{"name":"concatenate_Concatenate2","class_name":"Concatenate","config":{"axis":1,"name":"concatenate_Concatenate2","trainable":true},"inbound_nodes":[[["dropout_Dropout1",0,0,{}],["flatten_Flatten2",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":7,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["concatenate_Concatenate2",0,0,{}]]]}],"input_layers":[["embedded_words",0,0]],"output_layers":[["dense_Dense1",0,0]]},"keras_version":"tfjs-layers 0.8.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./classification.weights.bin"],"weights":[{"name":"classConv1/kernel","shape":[2,300,128],"dtype":"float32"},{"name":"classConv1/bias","shape":[128],"dtype":"float32"},{"name":"classConv2/kernel","shape":[4,300,128],"dtype":"float32"},{"name":"classConv2/bias","shape":[128],"dtype":"float32"},{"name":"classConv3/kernel","shape":[8,300,128],"dtype":"float32"},{"name":"classConv3/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[512,7],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[7],"dtype":"float32"}]}]}