{"modelTopology":{"class_name":"Model","config":{"name":"model2","layers":[{"name":"input4","class_name":"InputLayer","config":{"batch_input_shape":[null,20,300],"dtype":"float32","sparse":false,"name":"input4"},"inbound_nodes":[]},{"name":"input3","class_name":"InputLayer","config":{"batch_input_shape":[null,20,300],"dtype":"float32","sparse":false,"name":"input3"},"inbound_nodes":[]},{"name":"conv1d_Conv1D6","class_name":"Conv1D","config":{"filters":128,"kernel_initializer":{"class_name":"RandomNormal","config":{"mean":0,"stddev":0.05,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1],"strides":[1],"padding":"valid","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D6","trainable":true},"inbound_nodes":[[["input4",0,0,{}]]]},{"name":"input2","class_name":"InputLayer","config":{"batch_input_shape":[null,7],"dtype":"float32","sparse":false,"name":"input2"},"inbound_nodes":[]},{"name":"conv1d_Conv1D4","class_name":"Conv1D","config":{"filters":128,"kernel_initializer":{"class_name":"RandomNormal","config":{"mean":0,"stddev":0.05,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1],"strides":[1],"padding":"valid","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D4","trainable":true,"batch_input_shape":[null,20,300],"dtype":"float32"},"inbound_nodes":[[["input3",0,0,{}]]]},{"name":"dropout_Dropout2","class_name":"Dropout","config":{"rate":0.5,"noise_shape":null,"seed":null,"name":"dropout_Dropout2","trainable":true},"inbound_nodes":[[["conv1d_Conv1D6",0,0,{}]]]},{"name":"repeat_vector_RepeatVector1","class_name":"RepeatVector","config":{"n":20,"name":"repeat_vector_RepeatVector1","trainable":true},"inbound_nodes":[[["input2",0,0,{}]]]},{"name":"conv1d_Conv1D5","class_name":"Conv1D","config":{"filters":128,"kernel_initializer":{"class_name":"RandomNormal","config":{"mean":0,"stddev":0.05,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1],"strides":[1],"padding":"valid","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D5","trainable":true},"inbound_nodes":[[["conv1d_Conv1D4",0,0,{}]]]},{"name":"conv1d_Conv1D7","class_name":"Conv1D","config":{"filters":128,"kernel_initializer":{"class_name":"RandomNormal","config":{"mean":0,"stddev":0.05,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1],"strides":[1],"padding":"valid","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D7","trainable":true},"inbound_nodes":[[["dropout_Dropout2",0,0,{}]]]},{"name":"concatenate_Concatenate3","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate3","trainable":true},"inbound_nodes":[[["repeat_vector_RepeatVector1",0,0,{}],["input3",0,0,{}],["conv1d_Conv1D5",0,0,{}],["conv1d_Conv1D7",0,0,{}]]]},{"name":"bidirectional_Bidirectional1","class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"units":20,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"lstm_LSTM1","trainable":true}},"name":"bidirectional_Bidirectional1","trainable":true},"inbound_nodes":[[["concatenate_Concatenate3",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":5,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional1",0,0,{}]]]}],"input_layers":[["input2",0,0],["input3",0,0],["input4",0,0]],"output_layers":[["dense_Dense2",0,0]]},"keras_version":"tfjs-layers 0.7.5","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./ner.weights.bin"],"weights":[{"name":"conv1d_Conv1D6/kernel","shape":[1,300,128],"dtype":"float32"},{"name":"conv1d_Conv1D6/bias","shape":[128],"dtype":"float32"},{"name":"conv1d_Conv1D4/kernel","shape":[1,300,128],"dtype":"float32"},{"name":"conv1d_Conv1D4/bias","shape":[128],"dtype":"float32"},{"name":"conv1d_Conv1D5/kernel","shape":[1,128,128],"dtype":"float32"},{"name":"conv1d_Conv1D5/bias","shape":[128],"dtype":"float32"},{"name":"conv1d_Conv1D7/kernel","shape":[1,128,128],"dtype":"float32"},{"name":"conv1d_Conv1D7/bias","shape":[128],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/forward_lstm_LSTM1/kernel","shape":[563,80],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/forward_lstm_LSTM1/recurrent_kernel","shape":[20,80],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/forward_lstm_LSTM1/bias","shape":[80],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_lstm_LSTM1/kernel","shape":[563,80],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_lstm_LSTM1/recurrent_kernel","shape":[20,80],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_lstm_LSTM1/bias","shape":[80],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[40,5],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[5],"dtype":"float32"}]}]}