{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.1.2", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "embedded_words", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 300], "dtype": "float32", "sparse": false, "name": "embedded_words"}, "inbound_nodes": []}, {"name": "embedded_intent", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 7], "dtype": "float32", "sparse": false, "name": "embedded_intent"}, "inbound_nodes": []}, {"name": "nerConv1", "class_name": "Conv1D", "config": {"name": "nerConv1", "trainable": true, "batch_input_shape": [null, 28, 300], "dtype": "float32", "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedded_words", 0, 0, {}]]]}, {"name": "repeat_vector_1", "class_name": "RepeatVector", "config": {"name": "repeat_vector_1", "trainable": true, "n": 28}, "inbound_nodes": [[["embedded_intent", 0, 0, {}]]]}, {"name": "nerConv2", "class_name": "Conv1D", "config": {"name": "nerConv2", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["nerConv1", 0, 0, {}]]]}, {"name": "concatenate_3", "class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "axis": -1}, "inbound_nodes": [[["repeat_vector_1", 0, 0, {}], ["embedded_words", 0, 0, {}], ["nerConv2", 0, 0, {}]]]}, {"name": "bidi_encoder", "class_name": "Bidirectional", "config": {"name": "bidi_encoder", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 100, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": null}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"name": "attention_weight", "class_name": "TimeSeriesAttention", "config": {"name": "attention_weight", "trainable": true}, "inbound_nodes": [[["bidi_encoder", 0, 0, {}]]]}, {"name": "concatenate_4", "class_name": "Concatenate", "config": {"name": "concatenate_4", "trainable": true, "axis": -1}, "inbound_nodes": [[["attention_weight", 0, 0, {}], ["bidi_encoder", 0, 0, {}], ["bidi_encoder", 0, 1, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}], "input_layers": [["embedded_intent", 0, 0], ["embedded_words", 0, 0]], "output_layers": [["dense_2", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.006599999964237213, "beta_1": 0.0024999999441206455, "beta_2": 0.10000000149011612, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "attention_weight/att_dense1/kernel", "shape": [100, 100], "dtype": "float32"}, {"name": "attention_weight/att_dense1/bias", "shape": [100], "dtype": "float32"}, {"name": "attention_weight/att_dense2/kernel", "shape": [100, 100], "dtype": "float32"}, {"name": "attention_weight/att_dense2/bias", "shape": [100], "dtype": "float32"}, {"name": "bidi_encoder/forward_lstm_1/kernel", "shape": [435, 400], "dtype": "float32"}, {"name": "bidi_encoder/forward_lstm_1/recurrent_kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "bidi_encoder/forward_lstm_1/bias", "shape": [400], "dtype": "float32"}, {"name": "bidi_encoder/backward_lstm_1/kernel", "shape": [435, 400], "dtype": "float32"}, {"name": "bidi_encoder/backward_lstm_1/recurrent_kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "bidi_encoder/backward_lstm_1/bias", "shape": [400], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [300, 5], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [5], "dtype": "float32"}, {"name": "nerConv1/kernel", "shape": [1, 300, 128], "dtype": "float32"}, {"name": "nerConv1/bias", "shape": [128], "dtype": "float32"}, {"name": "nerConv2/kernel", "shape": [1, 128, 128], "dtype": "float32"}, {"name": "nerConv2/bias", "shape": [128], "dtype": "float32"}]}]}