{"modelTopology": {"keras_version": "2.1.6", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "embedded_word_characters", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 23, 6000], "dtype": "float32", "sparse": false, "name": "embedded_word_characters"}, "inbound_nodes": []}, {"name": "embedded_words", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 23, 300], "dtype": "float32", "sparse": false, "name": "embedded_words"}, "inbound_nodes": []}, {"name": "conv1d_6", "class_name": "Conv1D", "config": {"name": "conv1d_6", "trainable": true, "batch_input_shape": [null, 23, 6000], "dtype": "float32", "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedded_word_characters", 0, 0, {}]]]}, {"name": "embedded_intent", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 7], "dtype": "float32", "sparse": false, "name": "embedded_intent"}, "inbound_nodes": []}, {"name": "conv1d_4", "class_name": "Conv1D", "config": {"name": "conv1d_4", "trainable": true, "batch_input_shape": [null, 23, 300], "dtype": "float32", "filters": 256, "kernel_size": [1], "strides": [1], "padding": "valid", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedded_words", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv1d_6", 0, 0, {}]]]}, {"name": "repeat_vector_1", "class_name": "RepeatVector", "config": {"name": "repeat_vector_1", "trainable": true, "n": 23}, "inbound_nodes": [[["embedded_intent", 0, 0, {}]]]}, {"name": "conv1d_5", "class_name": "Conv1D", "config": {"name": "conv1d_5", "trainable": true, "filters": 256, "kernel_size": [1], "strides": [1], "padding": "valid", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_4", 0, 0, {}]]]}, {"name": "conv1d_7", "class_name": "Conv1D", "config": {"name": "conv1d_7", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "concatenate_3", "class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "axis": -1}, "inbound_nodes": [[["repeat_vector_1", 0, 0, {}], ["embedded_words", 0, 0, {}], ["conv1d_5", 0, 0, {}], ["conv1d_7", 0, 0, {}]]]}, {"name": "bidirectional_1", "class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 23, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]]}], "input_layers": [["embedded_intent", 0, 0], ["embedded_words", 0, 0], ["embedded_word_characters", 0, 0]], "output_layers": [["dense_2", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.006599999964237213, "beta_1": 0.0024999999441206455, "beta_2": 0.10000000149011612, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "bidirectional_1/forward_lstm_1/kernel", "shape": [691, 92], "dtype": "float32"}, {"name": "bidirectional_1/forward_lstm_1/recurrent_kernel", "shape": [23, 92], "dtype": "float32"}, {"name": "bidirectional_1/forward_lstm_1/bias", "shape": [92], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_1/kernel", "shape": [691, 92], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_1/recurrent_kernel", "shape": [23, 92], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_1/bias", "shape": [92], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "conv1d_4/kernel", "shape": [1, 300, 256], "dtype": "float32"}, {"name": "conv1d_4/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "conv1d_5/kernel", "shape": [1, 256, 256], "dtype": "float32"}, {"name": "conv1d_5/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "conv1d_6/kernel", "shape": [1, 6000, 128], "dtype": "float32"}, {"name": "conv1d_6/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "conv1d_7/kernel", "shape": [1, 128, 128], "dtype": "float32"}, {"name": "conv1d_7/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "dense_2/kernel", "shape": [46, 5], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [5], "dtype": "float32"}]}]}